In [15]:
import pandas as pd

In [16]:
data1 = {'Name': ['Tom', 'Joseph', 'Bob'], 'Age': [20, 21, 19]}

df1 = pd.DataFrame(data1)
df1

     Name  Age
0     Tom   20
1  Joseph   21
2     Bob   19

In [17]:
data2 = {'Name': ['Tom', 'Joseph'],"Salary":[50000,60000]}

df2 = pd.DataFrame(data2)
df2

     Name  Salary
0     Tom   50000
1  Joseph   60000

In [18]:
pd.merge(df1, df2, on='Name') ##配列の要素が一致するものだけを取り出し結合する
## on = "カラム名"で結合するカラムを指定できる

     Name  Age  Salary
0     Tom   20   50000
1  Joseph   21   60000

In [19]:
pd.merge(df1, df2, on='Name', how='left') ##左側(df1)のデータを優先して結合する

     Name  Age   Salary
0     Tom   20  50000.0
1  Joseph   21  60000.0
2     Bob   19      NaN

In [20]:
pd.merge(df1, df2, on='Name', how='right') ##右側(df2)のデータを優先して結合する

     Name  Age  Salary
0     Tom   20   50000
1  Joseph   21   60000

In [26]:
pd.concat([df1, df2]) ##データを縦に結合する ##axis=0がデフォルト

     Name   Age   Salary
0     Tom  20.0      NaN
1  Joseph  21.0      NaN
2     Bob  19.0      NaN
0     Tom   NaN  50000.0
1  Joseph   NaN  60000.0

In [27]:
pd.concat([df1, df2], axis=1) ##データを横に結合する

     Name  Age    Name   Salary
0     Tom   20     Tom  50000.0
1  Joseph   21  Joseph  60000.0
2     Bob   19     NaN      NaN